c5/src/InformationRegisters/Bank/Bank.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Bank</name>
  <resources>
    <name>Account</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Analytics</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </resources>
  <resources>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </resources>
  <resources>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </resources>
  <resources>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Operation</name>
    <type>
      <types>CatalogRef.Operations</types>
    </type>
  </resources>
  <resources>
    <name>Reference</name>
    <type>
      <types>DefinedType.Reference</types>
    </type>
  </resources>
  <resources>
    <name>ReferenceDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>DeletionMark</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Posted</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DefinedType.Bank</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/PaymentMethods/PaymentMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PaymentMethods</name>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>Check</name>
  </enumValues>
  <enumValues>
    <name>Visa</name>
  </enumValues>
  <enumValues>
    <name>Mastercard</name>
  </enumValues>
  <enumValues>
    <name>AmericanExpress</name>
  </enumValues>
  <enumValues>
    <name>EFT</name>
  </enumValues>
  <enumValues>
    <name>Bank</name>
  </enumValues>
  <enumValues>
    <name>PayPal</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReport</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/Operations/Operations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Operations</name>
  <enumValues>
    <name>AdditionalExpenses</name>
  </enumValues>
  <enumValues>
    <name>AdjustAdvances</name>
  </enumValues>
  <enumValues>
    <name>AdjustDebts</name>
  </enumValues>
  <enumValues>
    <name>AdjustVendorAdvances</name>
  </enumValues>
  <enumValues>
    <name>AdjustVendorDebts</name>
  </enumValues>
  <enumValues>
    <name>AdvanceApplied</name>
  </enumValues>
  <enumValues>
    <name>AdvanceGiven</name>
  </enumValues>
  <enumValues>
    <name>AdvanceTaken</name>
  </enumValues>
  <enumValues>
    <name>Assembling</name>
  </enumValues>
  <enumValues>
    <name>AutoWritingOffForm</name>
  </enumValues>
  <enumValues>
    <name>BankExpense</name>
  </enumValues>
  <enumValues>
    <name>BankReceipt</name>
  </enumValues>
  <enumValues>
    <name>CashExpense</name>
  </enumValues>
  <enumValues>
    <name>CashReceipt</name>
  </enumValues>
  <enumValues>
    <name>CustomerPayment</name>
  </enumValues>
  <enumValues>
    <name>CustomerRefund</name>
  </enumValues>
  <enumValues>
    <name>Disassembling</name>
  </enumValues>
  <enumValues>
    <name>DiscountGiven</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReceipt</name>
  </enumValues>
  <enumValues>
    <name>FixedAssetsDepreciation</name>
  </enumValues>
  <enumValues>
    <name>FixedAssetsReceipt</name>
  </enumValues>
  <enumValues>
    <name>IncomeTaxWithheld</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssetsAmortization</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssetsReceipt</name>
  </enumValues>
  <enumValues>
    <name>Invoice</name>
  </enumValues>
  <enumValues>
    <name>ItemsCost</name>
  </enumValues>
  <enumValues>
    <name>ItemsReceipt</name>
  </enumValues>
  <enumValues>
    <name>ItemsRetirement</name>
  </enumValues>
  <enumValues>
    <name>ItemsReturn</name>
  </enumValues>
  <enumValues>
    <name>LVIExploitation</name>
  </enumValues>
  <enumValues>
    <name>LVITransfer</name>
  </enumValues>
  <enumValues>
    <name>LVIWriteOff</name>
  </enumValues>
  <enumValues>
    <name>NegativeCurrencyDifference</name>
  </enumValues>
  <enumValues>
    <name>OffsetVATImport</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>OtherReceipt</name>
  </enumValues>
  <enumValues>
    <name>PaymentReturn</name>
  </enumValues>
  <enumValues>
    <name>PositiveCurrencyDifference</name>
  </enumValues>
  <enumValues>
    <name>ProductionOutput</name>
  </enumValues>
  <enumValues>
    <name>Sales</name>
  </enumValues>
  <enumValues>
    <name>SalesTax</name>
  </enumValues>
  <enumValues>
    <name>Transfer</name>
  </enumValues>
  <enumValues>
    <name>VATAdvances</name>
  </enumValues>
  <enumValues>
    <name>VATAdvancesReverse</name>
  </enumValues>
  <enumValues>
    <name>VATPayable</name>
  </enumValues>
  <enumValues>
    <name>VATReceivable</name>
  </enumValues>
  <enumValues>
    <name>VendorPayment</name>
  </enumValues>
  <enumValues>
    <name>VendorRefund</name>
  </enumValues>
  <enumValues>
    <name>WriteoffCharges</name>
  </enumValues>
</mdclass:Enum>

c5/src/InformationRegisters/Bank/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure Enroll ( Document ) export
	
	SetPrivilegedMode ( true );
	r = CreateRecordManager ();
	r.Date = Document.Date;
	r.Document = Document.Ref;
	type = TypeOf ( Document );
	if ( type = Type ( "DocumentObject.Entry" ) ) then
		passed = enrollEntry ( r, Document );
	elsif ( type = Type ( "DocumentObject.Payment" )
		or type = Type ( "DocumentObject.Refund" )
		or type = Type ( "DocumentObject.VendorPayment" )
		or type = Type ( "DocumentObject.VendorRefund" ) ) then
		passed = enrollPayment ( r, Document );
	elsif ( type = Type ( "DocumentObject.PayEmployees" ) ) then
		passed = enrollPayEmployees ( r, Document );
	endif; 
	if ( not passed ) then
		r.Delete ();
		return;
	endif; 
	r.Memo = Document.Memo;
	r.Number = Document.Number;
	r.Company = Document.Company;
	r.Posted = Document.Posted;
	r.DeletionMark = Document.DeletionMark;
	r.Reference = Document.Reference;
	r.ReferenceDate = Document.ReferenceDate;
	r.Write ();
	
EndProcedure 

Function enrollPayment ( Record, Document )
	
	if ( not bankPayment ( Document.Method ) ) then
		return false;
	endif; 
	Record.Amount = Document.Amount;
	Record.Currency = Document.Currency;
	Record.Account = Document.BankAccount;
	if ( TypeOf ( Document ) = Type ( "DocumentObject.Payment" )
		or TypeOf ( Document ) = Type ( "DocumentObject.Refund" ) ) then
		Record.Analytics = Document.Customer;
	else
		Record.Analytics = Document.Vendor;
	endif; 
	return true;
	
EndFunction

Function bankPayment ( Method )
	
	return method = Enums.PaymentMethods.AmericanExpress
	or method = Enums.PaymentMethods.Bank
	or method = Enums.PaymentMethods.EFT
	or method = Enums.PaymentMethods.Mastercard
	or method = Enums.PaymentMethods.PayPal
	or method = Enums.PaymentMethods.Visa;
	
EndFunction 

Function enrollPayEmployees ( Record, Document )
	
	if ( not bankPayment ( Document.Method ) ) then
		return false;
	endif; 
	Record.Amount = Document.Amount;
	Record.Currency = Application.Currency ();
	Record.Account = Document.BankAccount;
	return true;
	
EndFunction

#endif

Function enrollEntry ( Record, Document )
	
	operation = DF.Pick ( Document.Operation,  "Operation" );
	if ( operation = Enums.Operations.BankReceipt ) then
		entry = "Cr";
		bank = "Dr";
	elsif ( operation = Enums.Operations.BankExpense ) then
		entry = "Dr";
		bank = "Cr";
	else
		return false;
	endif; 
	records = Document.Records;
	if ( records.Count () = 0 ) then
		return true;
	endif; 
	row = records [ 0 ];
	Record.Operation = Document.Operation;
	Record.Account = row [ "Dim" + bank + "1" ];
	analytics = row [ "Dim" + entry + "1" ];
	account = row [ "Account" + entry ];
	if ( ValueIsFilled ( analytics ) ) then
		Record.Analytics = analytics;
	else
		Record.Analytics = DF.Pick ( account, ? ( Options.Russian (), "DescriptionRu", "DescriptionRo" ) );
	endif; 
	currency = DF.Pick ( account, "Currency", false );
	if ( currency ) then
		Record.Amount = row [ "CurrencyAmount" + entry ];
		Record.Currency = row [ "Currency" + entry ];
	else
		Record.Amount = row.Amount;
		Record.Currency = Application.Currency ();
	endif; 
	return true;
	
EndFunction
